## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 88 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.pomerium_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "pomerium_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.write_waf_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "write_waf_logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject*",
              + "s3:PutObject*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_acm_certificate.internal_domain will be created
  + resource "aws_acm_certificate" "internal_domain" {
      + arn                       = (known after apply)
      + domain_name               = "security.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.security.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "security.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.security.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.internal_domain_certificate_validation will be created
  + resource "aws_acm_certificate_validation" "internal_domain_certificate_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudwatch_log_group.pomerium_flow_log will be created
  + resource "aws_cloudwatch_log_group" "pomerium_flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "pomerium_flow_log"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.pomerium_sso_proxy will be created
  + resource "aws_cloudwatch_log_group" "pomerium_sso_proxy" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/pomerium_sso_proxy"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.pomerium_sso_proxy_auth will be created
  + resource "aws_cloudwatch_log_group" "pomerium_sso_proxy_auth" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/pomerium_sso_proxy_auth"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.sso_proxy_waf will be created
  + resource "aws_cloudwatch_log_group" "sso_proxy_waf" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/kinesisfirehose/sso_proxy_waf"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_ecs_cluster.pomerium_sso_proxy will be created
  + resource "aws_ecs_cluster" "pomerium_sso_proxy" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "pomerium_sso_proxy"
      + tags               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster.pomerium_sso_proxy_auth will be created
  + resource "aws_ecs_cluster" "pomerium_sso_proxy_auth" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "pomerium_sso_proxy_auth"
      + tags               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.pomerium_sso_proxy will be created
  + resource "aws_ecs_service" "pomerium_sso_proxy" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "pomerium_sso_proxy"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "pomerium_sso_proxy"
          + container_port   = 443
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.pomerium_sso_proxy_auth will be created
  + resource "aws_ecs_service" "pomerium_sso_proxy_auth" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "pomerium_sso_proxy_auth"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # aws_ecs_task_definition.pomerium_sso_proxy will be created
  + resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "pomerium_sso_proxy"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy_auth will be created
  + resource "aws_ecs_task_definition" "pomerium_sso_proxy_auth" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "pomerium_sso_proxy_auth"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_flow_log.pomerium will be created
  + resource "aws_flow_log" "pomerium" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_policy.pomerium_policies will be created
  + resource "aws_iam_policy" "pomerium_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "PomeriumSSOTaskExecutionPolicies"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.write_waf_logs will be created
  + resource "aws_iam_policy" "write_waf_logs" {
      + arn         = (known after apply)
      + description = "Allow writing WAF logs to S3 + CloudWatch"
      + id          = (known after apply)
      + name        = "security-tools_WriteLogs"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.pomerium_container_execution_role will be created
  + resource "aws_iam_role" "pomerium_container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs.amazonaws.com",
                              + "ec2.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "container_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.pomerium_task_execution_role will be created
  + resource "aws_iam_role" "pomerium_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pomerium_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.waf_log_role will be created
  + resource "aws_iam_role" "waf_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "security-tools-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ce_cs will be created
  + resource "aws_iam_role_policy_attachment" "ce_cs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "container_execution_role"
    }

  # aws_iam_role_policy_attachment.cloudwatch_policies will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "pomerium_execution_role"
    }

  # aws_iam_role_policy_attachment.ec2_container_registery_policies will be created
  + resource "aws_iam_role_policy_attachment" "ec2_container_registery_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "pomerium_execution_role"
    }

  # aws_iam_role_policy_attachment.ecs_container_registery_policies will be created
  + resource "aws_iam_role_policy_attachment" "ecs_container_registery_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonECSTaskExecutionRolePolicy"
      + role       = "pomerium_execution_role"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "pomerium_execution_role"
    }

  # aws_iam_role_policy_attachment.pomerium_policies will be created
  + resource "aws_iam_role_policy_attachment" "pomerium_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pomerium_execution_role"
    }

  # aws_iam_role_policy_attachment.write_waf_logs will be created
  + resource "aws_iam_role_policy_attachment" "write_waf_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "security-tools-logs"
    }

  # aws_kinesis_firehose_delivery_stream.sso_proxy_waf will be created
  + resource "aws_kinesis_firehose_delivery_stream" "sso_proxy_waf" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-security-tools"
      + tags           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = (known after apply)
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "UNCOMPRESSED"
          + prefix             = "waf/security-tools/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = true
              + log_group_name  = "/aws/kinesisfirehose/sso_proxy_waf"
              + log_stream_name = "WAFLogS3Delivery"
            }
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_lb.pomerium will be created
  + resource "aws_lb" "pomerium" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = true
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "pomerium-sso"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                   = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + access_logs {
          + bucket  = "cbs-satellite-794722365809"
          + enabled = true
          + prefix  = "lb_logs"
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2020-10"
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener_certificate.https_sni will be created
  + resource "aws_lb_listener_certificate" "https_sni" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
      + listener_arn    = (known after apply)
    }

  # aws_lb_target_group.ecs will be created
  + resource "aws_lb_target_group" "ecs" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "ecs"
      + port                               = 443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

17 tests, 17 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
